xmls/test-bkrt-refund-new.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.nbc.org.kh/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:makeFullFundTransfer>
         <web:cm_user_name>bora</web:cm_user_name>
         <web:cm_password>B@ora123</web:cm_password>
         <web:ext_ref>BKRTKHPPXXX/TOURKHPPXXX/9847562103</web:ext_ref>
         <web:iso_message><![CDATA[<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<Document xsi:schemaLocation="xsd/pain.001.001.05.xsd" xmlns="urn:iso:std:iso:20022:tech:xsd:pain.001.001.05" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <CstmrCdtTrfInitn>
        <GrpHdr>
            <MsgId>CRTBKRTKHPPXXX1738262445678</MsgId>
            <CreDtTm>2026-01-30T16:20:45.678+07:00</CreDtTm>
            <NbOfTxs>1</NbOfTxs>
            <CtrlSum>75000</CtrlSum>
            <InitgPty>
                <Nm>BKRT</Nm>
            </InitgPty>
        </GrpHdr>
        <PmtInf>
            <PmtInfId>BKRTKHPPXXX/TOURKHPPXXX/9847562103</PmtInfId>
            <PmtMtd>TRF</PmtMtd>
            <BtchBookg>false</BtchBookg>
            <ReqdExctnDt>2026-01-30</ReqdExctnDt>
            <Dbtr>
                <Nm>BKRT</Nm>
            </Dbtr>
            <DbtrAcct>
                <Id>
                    <Othr>
                        <Id>bkrtkhppxxx@bkrt</Id>
                    </Othr>
                </Id>
                <Ccy>KHR</Ccy>
            </DbtrAcct>
            <DbtrAgt>
                <FinInstnId>
                    <BICFI>BKRTKHPPXXX</BICFI>
                </FinInstnId>
            </DbtrAgt>
            <CdtTrfTxInf>
                <PmtId>
                    <InstrId>BKRTKHPPXXX/9847562103</InstrId>
                    <EndToEndId>bkrtkhppxxx@bkrt-015039685739105</EndToEndId>
                </PmtId>
                <Amt>
                    <InstdAmt Ccy="KHR">75000</InstdAmt>
                </Amt>
                <ChrgBr>CRED</ChrgBr>
                <CdtrAgt>
                    <FinInstnId>
                        <BICFI>TOURKHPPXXX</BICFI>
                    </FinInstnId>
                </CdtrAgt>
                <Cdtr>
                    <Nm>TOUR Refund Recipient</Nm>
                </Cdtr>
                <CdtrAcct>
                    <Id>
                        <Othr>
                            <Id>015039685739105</Id>
                        </Othr>
                    </Id>
                </CdtrAcct>
                <Purp>
                    <Cd>GDDS</Cd>
                </Purp>
                <RmtInf>
                    <Ustrd>BKRT-Refund-NBCHQ-Test-1738262445678</Ustrd>
                    <Strd>
                        <RfrdDocInf>
                            <Tp>
                                <CdOrPrtry>
                                    <Cd>CINV</Cd>
                                </CdOrPrtry>
                            </Tp>
                            <Nb>1</Nb>
                            <RltdDt>2026-01-30+07:00</RltdDt>
                        </RfrdDocInf>
                        <AddtlRmtInf>Phnom Penh/9847562103</AddtlRmtInf>
                    </Strd>
                </RmtInf>
            </CdtTrfTxInf>
        </PmtInf>
    </CstmrCdtTrfInitn>
</Document>]]></web:iso_message>
      </web:makeFullFundTransfer>
   </soapenv:Body>
</soapenv:Envelope>
